<a href="https://colab.research.google.com/github/hanna-joo/bigdata_edu/blob/master/python_edu/pandas_basic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

[10 minutes to pandas](https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html)

In [1]:
import numpy as np
import pandas as pd

# 1. 변수 생성 (Object creation)

In [2]:
# Series 생성
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
# DataFrame 생성: Numpy 행렬
dates = pd.date_range('20130101',periods=6)
print(dates)
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))
df

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

                   A         B         C         D
2013-01-01  0.768052 -0.745254 -2.007645 -0.664372
2013-01-02 -0.049474  0.052496  0.185157  1.052250
2013-01-03  2.704358  1.083715  0.262155 -0.944823
2013-01-04 -0.119837 -1.501685  1.709729  0.225568
2013-01-05 -0.333767  1.241019 -0.378139  1.074417
2013-01-06  0.810094 -1.104987 -1.184550 -0.439012

In [4]:
# DataFrame 생성: 딕셔너리
df2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3]*4, dtype='int32'),
                    'E': pd.Categorical(['test','train','test','train']),
                    'F': 'foo'})
print(df2.dtypes)
df2

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

# 2. 데이터 확인 (Viewing data)

In [5]:
df.head(2)

                   A         B         C         D
2013-01-01  0.768052 -0.745254 -2.007645 -0.664372
2013-01-02 -0.049474  0.052496  0.185157  1.052250

In [6]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [8]:
# Numpy 행렬에는 단 한가지의 dtype만 가능
# Pandas 데이터 프레임에는 컬럼당 한가지의 dtype만 가능
df.to_numpy()

array([[ 0.76805192, -0.74525362, -2.00764517, -0.66437228],
       [-0.04947407,  0.05249592,  0.18515675,  1.05224954],
       [ 2.70435753,  1.08371512,  0.26215492, -0.94482293],
       [-0.11983727, -1.50168458,  1.70972861,  0.22556805],
       [-0.33376742,  1.24101937, -0.37813924,  1.0744167 ],
       [ 0.81009409, -1.10498731, -1.18455049, -0.43901192]])

In [9]:
# 여러 dtype이 존재하는 df2를 numpy로 변환 시 모든 것을 아우르는 dtype 선택
  # DataFrame.to_numpy(): 인덱스와 컬럼명은 포함되지 않음
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [10]:
# df의 통계 요약
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.629904 -0.162449 -0.235549  0.050671
std    1.123142  1.148080  1.286085  0.874516
min   -0.333767 -1.501685 -2.007645 -0.944823
25%   -0.102246 -1.015054 -0.982948 -0.608032
50%    0.359289 -0.346379 -0.096491 -0.106722
75%    0.799584  0.825910  0.242905  0.845579
max    2.704358  1.241019  1.709729  1.074417

In [11]:
# df의 행과 열 바꾸기
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.768052   -0.049474    2.704358   -0.119837   -0.333767    0.810094
B   -0.745254    0.052496    1.083715   -1.501685    1.241019   -1.104987
C   -2.007645    0.185157    0.262155    1.709729   -0.378139   -1.184550
D   -0.664372    1.052250   -0.944823    0.225568    1.074417   -0.439012

In [12]:
# 행 또는 열 값에 따라 나열하기
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.664372 -2.007645 -0.745254  0.768052
2013-01-02  1.052250  0.185157  0.052496 -0.049474
2013-01-03 -0.944823  0.262155  1.083715  2.704358
2013-01-04  0.225568  1.709729 -1.501685 -0.119837
2013-01-05  1.074417 -0.378139  1.241019 -0.333767
2013-01-06 -0.439012 -1.184550 -1.104987  0.810094

In [13]:
df.sort_index(ascending=False)

                   A         B         C         D
2013-01-06  0.810094 -1.104987 -1.184550 -0.439012
2013-01-05 -0.333767  1.241019 -0.378139  1.074417
2013-01-04 -0.119837 -1.501685  1.709729  0.225568
2013-01-03  2.704358  1.083715  0.262155 -0.944823
2013-01-02 -0.049474  0.052496  0.185157  1.052250
2013-01-01  0.768052 -0.745254 -2.007645 -0.664372

In [14]:
# 값에 따라 나열하기
df.sort_values(by="B")

                   A         B         C         D
2013-01-04 -0.119837 -1.501685  1.709729  0.225568
2013-01-06  0.810094 -1.104987 -1.184550 -0.439012
2013-01-01  0.768052 -0.745254 -2.007645 -0.664372
2013-01-02 -0.049474  0.052496  0.185157  1.052250
2013-01-03  2.704358  1.083715  0.262155 -0.944823
2013-01-05 -0.333767  1.241019 -0.378139  1.074417

In [15]:
df.sort_values(by="B", ascending=False)

                   A         B         C         D
2013-01-05 -0.333767  1.241019 -0.378139  1.074417
2013-01-03  2.704358  1.083715  0.262155 -0.944823
2013-01-02 -0.049474  0.052496  0.185157  1.052250
2013-01-01  0.768052 -0.745254 -2.007645 -0.664372
2013-01-06  0.810094 -1.104987 -1.184550 -0.439012
2013-01-04 -0.119837 -1.501685  1.709729  0.225568

# 3. 데이터 선택 (Selection)
- .at / .iat
- .loc / .iloc
- .isin

In [16]:
# 해당하는 열 가져오기
df['A']  # df.A

2013-01-01    0.768052
2013-01-02   -0.049474
2013-01-03    2.704358
2013-01-04   -0.119837
2013-01-05   -0.333767
2013-01-06    0.810094
Freq: D, Name: A, dtype: float64

In [17]:
# 해당하는 행 가져오기
df[2:4]  # df['20130103':'20130104']

                   A         B         C         D
2013-01-03  2.704358  1.083715  0.262155 -0.944823
2013-01-04 -0.119837 -1.501685  1.709729  0.225568

## 인덱스 또는 컬럼명으로 가져오기 (.loc)

In [18]:
# 인덱스 값으로 가져오기
df.loc['20130101']

A    0.768052
B   -0.745254
C   -2.007645
D   -0.664372
Name: 2013-01-01 00:00:00, dtype: float64

In [19]:
# 지정한 행과 열에 해당하는 값 가져오기
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.768052 -0.745254
2013-01-02 -0.049474  0.052496
2013-01-03  2.704358  1.083715
2013-01-04 -0.119837 -1.501685
2013-01-05 -0.333767  1.241019
2013-01-06  0.810094 -1.104987

In [20]:
df.loc['20130102':'20130104', 'A':'C']

                   A         B         C
2013-01-02 -0.049474  0.052496  0.185157
2013-01-03  2.704358  1.083715  0.262155
2013-01-04 -0.119837 -1.501685  1.709729

In [21]:
df.loc['20130102':'20130104', ['A','C']]

                   A         C
2013-01-02 -0.049474  0.185157
2013-01-03  2.704358  0.262155
2013-01-04 -0.119837  1.709729

In [22]:
df.loc[dates[0],'A']

0.7680519225849595

In [23]:
# .at: scalar 가져올 때 .loc 보다 더 빠른 방법
df.at[dates[0],'A']

0.7680519225849595

## 좌표값으로 가져오기 (.iloc)

In [24]:
df.iloc[2]

A    2.704358
B    1.083715
C    0.262155
D   -0.944823
Name: 2013-01-03 00:00:00, dtype: float64

In [25]:
df.iloc[3:5]  # df[3:5] / df['20130104':'20130105']

                   A         B         C         D
2013-01-04 -0.119837 -1.501685  1.709729  0.225568
2013-01-05 -0.333767  1.241019 -0.378139  1.074417

In [26]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.119837 -1.501685
2013-01-05 -0.333767  1.241019

In [27]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.049474  0.185157
2013-01-03  2.704358  0.262155
2013-01-05 -0.333767 -0.378139

In [28]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.049474  0.052496  0.185157  1.052250
2013-01-03  2.704358  1.083715  0.262155 -0.944823

In [29]:
df.iloc[1,1]

0.05249592043670383

In [30]:
# .iat: scalar 가져올 때 .iloc 보다 더 빠른 방법
df.iat[1,1]

0.05249592043670383

## 조건에 해당하는 값 가져오기 (.isin)

In [31]:
df[df['A']>0]

                   A         B         C         D
2013-01-01  0.768052 -0.745254 -2.007645 -0.664372
2013-01-03  2.704358  1.083715  0.262155 -0.944823
2013-01-06  0.810094 -1.104987 -1.184550 -0.439012

In [32]:
df[df>0]

                   A         B         C         D
2013-01-01  0.768052       NaN       NaN       NaN
2013-01-02       NaN  0.052496  0.185157  1.052250
2013-01-03  2.704358  1.083715  0.262155       NaN
2013-01-04       NaN       NaN  1.709729  0.225568
2013-01-05       NaN  1.241019       NaN  1.074417
2013-01-06  0.810094       NaN       NaN       NaN

In [33]:
df2 = df.copy()
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01  0.768052 -0.745254 -2.007645 -0.664372    one
2013-01-02 -0.049474  0.052496  0.185157  1.052250    one
2013-01-03  2.704358  1.083715  0.262155 -0.944823    two
2013-01-04 -0.119837 -1.501685  1.709729  0.225568  three
2013-01-05 -0.333767  1.241019 -0.378139  1.074417   four
2013-01-06  0.810094 -1.104987 -1.184550 -0.439012  three

In [34]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  2.704358  1.083715  0.262155 -0.944823   two
2013-01-05 -0.333767  1.241019 -0.378139  1.074417  four

## 값 설정하기

In [35]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [36]:
df

                   A         B         C         D
2013-01-01  0.768052 -0.745254 -2.007645 -0.664372
2013-01-02 -0.049474  0.052496  0.185157  1.052250
2013-01-03  2.704358  1.083715  0.262155 -0.944823
2013-01-04 -0.119837 -1.501685  1.709729  0.225568
2013-01-05 -0.333767  1.241019 -0.378139  1.074417
2013-01-06  0.810094 -1.104987 -1.184550 -0.439012

In [37]:
# 새로운 컬럼 추가(인덱스에 해당하는 값만 가져옴)
df['F'] = s1
df

                   A         B         C         D    F
2013-01-01  0.768052 -0.745254 -2.007645 -0.664372  NaN
2013-01-02 -0.049474  0.052496  0.185157  1.052250  1.0
2013-01-03  2.704358  1.083715  0.262155 -0.944823  2.0
2013-01-04 -0.119837 -1.501685  1.709729  0.225568  3.0
2013-01-05 -0.333767  1.241019 -0.378139  1.074417  4.0
2013-01-06  0.810094 -1.104987 -1.184550 -0.439012  5.0

In [38]:
# 새로운 값으로 바꾸기
df.at[dates[0],'A'] = 0
df.iat[0, 1] = 0
df.loc[:, 'D'] = np.array([5] * len(df))
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -2.007645  5  NaN
2013-01-02 -0.049474  0.052496  0.185157  5  1.0
2013-01-03  2.704358  1.083715  0.262155  5  2.0
2013-01-04 -0.119837 -1.501685  1.709729  5  3.0
2013-01-05 -0.333767  1.241019 -0.378139  5  4.0
2013-01-06  0.810094 -1.104987 -1.184550  5  5.0

In [39]:
df2 = df.copy()
df2[df2>0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -2.007645 -5  NaN
2013-01-02 -0.049474 -0.052496 -0.185157 -5 -1.0
2013-01-03 -2.704358 -1.083715 -0.262155 -5 -2.0
2013-01-04 -0.119837 -1.501685 -1.709729 -5 -3.0
2013-01-05 -0.333767 -1.241019 -0.378139 -5 -4.0
2013-01-06 -0.810094 -1.104987 -1.184550 -5 -5.0

# 4. 결측치 처리 (Missing data)

In [40]:
# 인덱스 변경/추가/삭제: reindex
df1 = df.reindex(index=dates[0:4], columns=list(df.columns)+['E'])
df1.loc[dates[0]:dates[1],'E'] = 1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -2.007645  5  NaN  1.0
2013-01-02 -0.049474  0.052496  0.185157  5  1.0  1.0
2013-01-03  2.704358  1.083715  0.262155  5  2.0  NaN
2013-01-04 -0.119837 -1.501685  1.709729  5  3.0  NaN

In [41]:
# 결측치 있는 행 모두 삭제
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02 -0.049474  0.052496  0.185157  5  1.0  1.0

In [42]:
# 모든 결측치 값에 5 넣기
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -2.007645  5  5.0  1.0
2013-01-02 -0.049474  0.052496  0.185157  5  1.0  1.0
2013-01-03  2.704358  1.083715  0.262155  5  2.0  5.0
2013-01-04 -0.119837 -1.501685  1.709729  5  3.0  5.0

In [43]:
# 특정 컬럼의 결측치 값에 5 넣기
df1.F.fillna(value=5)

2013-01-01    5.0
2013-01-02    1.0
2013-01-03    2.0
2013-01-04    3.0
Freq: D, Name: F, dtype: float64

In [44]:
# 결측치 있는지 없는지 위치 확인하기
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

# 5. 조작 (Operations)

## 데이터 프레임의 기본 통계 구하기

In [45]:
print(df.mean())  # 컬럼별 평균
print(df.mean(1)) # 행별 평균

A    0.501895
B   -0.038240
C   -0.235549
D    5.000000
F    3.000000
dtype: float64
2013-01-01    0.748089
2013-01-02    1.237636
2013-01-03    2.210046
2013-01-04    1.617641
2013-01-05    1.905823
2013-01-06    1.704111
Freq: D, dtype: float64

In [46]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [47]:
print(df)
df.sub(s, axis='index')

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -2.007645  5  NaN
2013-01-02 -0.049474  0.052496  0.185157  5  1.0
2013-01-03  2.704358  1.083715  0.262155  5  2.0
2013-01-04 -0.119837 -1.501685  1.709729  5  3.0
2013-01-05 -0.333767  1.241019 -0.378139  5  4.0
2013-01-06  0.810094 -1.104987 -1.184550  5  5.0

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03  1.704358  0.083715 -0.737845  4.0  1.0
2013-01-04 -3.119837 -4.501685 -1.290271  2.0  0.0
2013-01-05 -5.333767 -3.758981 -5.378139  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

## 데이터 프레임에 함수 적용하기: df.apply()

In [48]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -2.007645  5  NaN
2013-01-02 -0.049474  0.052496  0.185157  5  1.0
2013-01-03  2.704358  1.083715  0.262155  5  2.0
2013-01-04 -0.119837 -1.501685  1.709729  5  3.0
2013-01-05 -0.333767  1.241019 -0.378139  5  4.0
2013-01-06  0.810094 -1.104987 -1.184550  5  5.0

In [49]:
# df의 컬럼별로 누적합 구하기
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000 -2.007645   5   NaN
2013-01-02 -0.049474  0.052496 -1.822488  10   1.0
2013-01-03  2.654883  1.136211 -1.560333  15   3.0
2013-01-04  2.535046 -0.365474  0.149395  20   6.0
2013-01-05  2.201279  0.875546 -0.228744  25  10.0
2013-01-06  3.011373 -0.229441 -1.413295  30  15.0

In [50]:
# df의 컬럼별로 lambda함수 적용하기
df.apply(lambda x:x.max()-x.min())

A    3.038125
B    2.742704
C    3.717374
D    0.000000
F    4.000000
dtype: float64

## 열의 value 개수 세기: s.value_counts()

In [51]:
s = pd.Series(np.random.randint(0,7,size=10))
s

0    3
1    3
2    5
3    0
4    0
5    3
6    0
7    1
8    2
9    1
dtype: int64

In [52]:
s.value_counts()

3    3
0    3
1    2
5    1
2    1
dtype: int64

## 문자열 조작하기

In [53]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [54]:
# 대문자 > 소문자로 만들기
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

# 6. 합치기 (Merge)
- pd.concat()
- pd.merge()

In [56]:
df = pd.DataFrame(np.random.randn(10, 4))
print(df)
# 데이터 프레임 여러 조각으로 쪼개기
pieces = [df[:3],df[3:7],df[7:]]
pd.concat(pieces)

          0         1         2         3
0 -0.643071  0.183491 -0.719907 -1.434433
1  0.425673 -1.926336 -0.123449  1.714379
2  0.322490 -0.526114  0.689793  1.151965
3 -1.302970 -0.742798 -1.511758  0.836161
4  0.172819 -0.648345  3.104518 -1.246428
5 -0.616410 -0.163201 -0.504472 -0.058854
6 -1.087617 -0.066940  0.761984 -2.009727
7  0.557765 -0.838272 -0.049576  0.110887
8 -1.216580  0.514694 -0.106928 -0.126002
9 -0.912519 -1.187425 -1.798989 -0.166210

          0         1         2         3
0 -0.643071  0.183491 -0.719907 -1.434433
1  0.425673 -1.926336 -0.123449  1.714379
2  0.322490 -0.526114  0.689793  1.151965
3 -1.302970 -0.742798 -1.511758  0.836161
4  0.172819 -0.648345  3.104518 -1.246428
5 -0.616410 -0.163201 -0.504472 -0.058854
6 -1.087617 -0.066940  0.761984 -2.009727
7  0.557765 -0.838272 -0.049576  0.110887
8 -1.216580  0.514694 -0.106928 -0.126002
9 -0.912519 -1.187425 -1.798989 -0.166210

In [59]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key':['foo','foo'],'rval':[4,5]})
print(left,'\n')
print(right,'\n')
pd.merge(left, right, on='key')

   key  lval
0  foo     1
1  foo     2

   key  rval
0  foo     4
1  foo     5

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [60]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
right = pd.DataFrame({'key':['foo','bar'],'rval':[4,5]})
print(left,'\n')
print(right,'\n')
pd.merge(left, right, on='key')

   key  lval
0  foo     1
1  bar     2

   key  rval
0  foo     4
1  bar     5

   key  lval  rval
0  foo     1     4
1  bar     2     5

# 7. 그룹화하기 (Grouping)
- step1: 데이터 쪼개기
- step2: 각 그룹별로 함수 적용하기
- step3: 결과 결합하기

In [61]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                        'foo', 'bar', 'foo', 'foo'],
                  'B': ['one', 'one', 'two', 'three',
                        'two', 'two', 'one', 'three'],
                  'C': np.random.randn(8),
                  'D': np.random.randn(8)})
df

     A      B         C         D
0  foo    one -0.700942  1.399061
1  bar    one  1.241829 -0.645489
2  foo    two  0.502310  1.279599
3  bar  three  1.541703 -0.591823
4  foo    two -0.285051  0.856261
5  bar    two  0.478790  0.999646
6  foo    one -0.793984  0.094111
7  foo  three -0.840535 -0.210951

In [62]:
df.groupby('A').sum()

            C         D
A
bar  3.262322 -0.237666
foo -2.118201  3.418082

In [63]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one    1.241829 -0.645489
    three  1.541703 -0.591823
    two    0.478790  0.999646
foo one   -1.494926  1.493172
    three -0.840535 -0.210951
    two    0.217259  2.135861